{
  "pages": [
    {
      "number": 1,
      "content": "Dilip Agheda \nSoftware Engineer \nI am a technology professional who is a life-long learner, analytical and willing to adapt to different \nsituat ions with positive attitude and my goal is to give my 100% to an organization where I can \napply my technology skills to help them achieve their goal. \nI have been involved in hands-on programming since 2001. More recently, I have been implementing \nenterprise solutions using React, JavaScript, NodeJS and AWS. \nGithub https://github.com/dilipagheda \nPortfolio https://dilipagheda.com/ \nLinkedin https://www.linkedin.com/in/dilipagheda/ \nStackoverflow https://stackoverflow.com/users/5680541/dilip-agheda \nPhone 0401 291 718 \nEmail Dilip_agheda@yahoo.com \n \nRecent Achievements \n \n• I recently completed 3 years and 2 months of contract as a Software Engineer at Origin \nEnergy having worked on React, TypeScript, NodeJS, JavaScript and AWS. \n• I have delivered a digital solution named as “MyDay” for Origin Energy over the period of 18 \nmonths which consisted of more than 20 high quality production releases. I built most of the \nfunctionality of this solution using React, JavaScript and AWS serverless. \n• I also delivered features across “Well performance monitoring” and “Turn down” \napplications for Origin Energy. I used React, Redux, NodeJS, AWS serverless set of \ntechnologies, AWS Opensearch to build these features. \n• I passed JSNAD and JSNSD certifications within JavaScript space offered by Linux Foundation \nby passing hands-on tests. \n• I passed AWS certified developer associate certification and Terraform certified associate in \ncloud computing. \n• I have completed following online coding boot camps. Please check out my github: \nhttps://github.com/dilipagheda where I have built more than 45 projects using various tech. \nI also maintain my own website built with React and Redux with project portfolio. \n(https://www.dilipagheda.com)  \n• Intermediate JavaScript Nanodegree – Udacity, July 2020 (Built 3 projects) \n• Frontend Developer Nanodegree, 2020  – Udacity, Nov 2020 (Built 5 projects) \n• AWS Cloud Developer Nanodegree – Udacity, Nov 2020 (Built 5 projects) \n• React developer Nanodegree - Udacity , Oct 2019 (Built 3 projects)  \n• Frontend Web developer Nanodegree 2019  - Udacity , Feb 2019 (Built 5 projects)  \n• Frontend Web development Techdegree - Teamtreehouse , Dec 2018 (Built 9 \nprojects)  \n• Fullstack JavaScript Tech degree - Teamtreehouse , March 2019 (Built 12 projects) \n• SQL Nanodegree – Udacity, 2023 (Build 5 projects) \n• Backend .NET Developer Bootcamp – Openclassrooms (In progress) \n\n• Android developer Nanodegree - Term1 - Udacity, Oct 2018 (Built 3 projects)  \n• Front-End Web UI Frameworks and Tools: Bootstrap 4 - Coursera (Built a Bootstrap \nwebsite) \n• At  CommBank  (CFS),  I  have  developed  React  components  which  got  deployed  in  the \nProduction web application and developed Batch Processor project to allow background file \nprocessing. \n• At  CommBank,  I worked  on a Rebatehub  project  and developed Automation framework  for \nWeb   using   Behaviour   driven   development   (BDD)   approach   using   SpecFlow,   Selenium \nWebdriver, C#, SQL Server and RestSharp API library. \n \n• I have passed following certifications.  \n• Microsoft Specialist – Programming in C#  \n• Microsoft Specialist – SQL Server  \n• Microsoft Specialist – HTML, CSS & JavaScript \n• JSNAD - OpenJS Certified NodeJS Applications Developer \n• JSNSD – OpenJS Certified Services Developer \n• AWS Certified Applications Developer Associate \n• Hashicorp certified Terraform Associate \nSkills \nFront-end web development \n• HTML, CSS, SASS, JavaScript, ES6, jQuery, TypeScript, \nBootstrap \n• React & Redux, RxJS \n• Unit testing with Jest/Jasmine/Mocha/Chai \nBack-end web development \n• JavaScript/Node.js / Express / Fastify / Pug  \n• Unit testing with NUnit/xUnit  \n• SQL Server / MongoDB / ElasticSearch / Opensearch \n• C#/.NET & Core MVC/Web API \nCloud Development \n• Serverless with API Gateway, Lambda and DynamoDB \n• Serverless Framework \n• Deploying static websites using S3 \n• Refactoring Monolith application into microservices \n• AWS Certified Developer Associate \nTest Automation Selenium,  Postman/Newman, Specflow, BDD, Protractor, \nCypress, Cucumber \nMobile Development Android, iOS, Flutter & React Native (Built few side projects as \npart of Udacity Nanodegrees and online courses) \n  \n\nWork experience \nSoftware Engineer \nOrigin Energy \nJan 2021 – Present \n• Delivered a digital solution named as “MyDay” for Origin Energy over the period of 18 \nmonths which consisted of more than 20 high quality production releases. I built most of the \nfunctionality of this solution using React, JavaScript and AWS serverless. \n• Enabled the delivery of more than 500 digital forms in a very short time through \ndevelopment of a form engine. Form engine was written in React and it provided the ability \nto render user input forms of any complexity through a dynamic configuration file. \n• Built Offline first React - Frontend App for Myday platform that allows rapid provisioning of \ndigital forms through a form engine & has offline and data syncing capabilities. \n• Used PWA features of a web app comprehensively. These features were indexDB database, \nservice worker, offline caching and data syncing \n• Designed and developed a data syncing capability between offline first frontend web app \nand the AWS hosted backend. \n• Designed and developed image gallery widget in the MyDay app which also allowed offline \ncaching of assets. \n• Implemented a functionality called dynamic sections. It allowed adding or removing \narbitrary number of sections within a form at run-time. \n• Designed and developed a complex digital form called HCC form which had nested forms. \nI.e., forms within forms. I devised a recursive algorithm which renders such a form with \narbitrary nested child forms. \n• Implemented data validation rules in a generic way across number of UI widgets that \nprovided a system of plug-n-play to enable a certain set of rules. \n• Provided production support for field issues and provided rectification within a reasonable \ntimeframe. \n• Refactored legacy code by employing JavaScript design patterns (strategy, builder, factory, \nservice-repository etc) to make it maintainable and scalable while reducing bundle size and \nimproving performance \n• Delivered data analytics applications named as WPA and TurnDown using React, Node, AWS, \nPostgress, Sequalize framework, OpenSearch and DynamoDB. \n• Built several Backend features using AWS Serverless by leveraging API Gateway, Cognito, \nDynamoDB, SQS Queues and Lambda functions. \n• Solved a severe performance issue by implementing server-side pagination and leveraging \nOpenSearch in backend for filters. \n• Customised 3\nrd\n party libraries such as mui datatable to implement server-side pagination \nand server-side filtering and search. \n• Built a dynamic mini form engine to render use input forms based on a config file residing \nwithin a DynamoDB database. This feature enabled users to input data related to various \nsetpoints used in oil and gas industry. \n• Solved user pain-points by implementing a UI drawer to load forms into. This feature \nallowed them to have a form and rest of the app open side by side. \n• Worked closely with BAs, Test engineers and Data scientists. \n\n• Collaborated with the platform team to re-architect and implement syncing data \nfunctionality. \n• Helped and mentored team members from all disciplines showing team spirit while also \nallowing myself to be mentored by tech leads. \nTech stack: React, Redux, RxJS, Sagas, SQS, IndexDB, service workers, TypeScript, JavaScript, PWA, \nOffline-First, AWS, Serverless, Lambda, Node.js, DynamoDB, Postgress, Opensearch. \n \nSoftware Engineer \nCommonwealth Bank \nDec 2019 – Dec 2020 \n• Contributed to the development of an application using HTML, C# & APIs that digitises paper \nbased letters and sends it to clients via a portal, saving $1M in mailing costs. \n• Developed Automation testing framework using NodeJS to test restful APIs. \n• Developed a Database Syncing Application using .Net Core, Hangfire, C# and SQL that syncs \nbusiness data between legacy database and modern counterpart. Worked very closely with \nDevelopment Lead to get this delivered. \n• Developed React components along with unit tests (Jest), story book and automated tests \n(Cypress) \n• Contributed to a Project called Digital Communications Channel (DCC) within Colonial First \nEstate (CFS) division of Commonwealth Bank. \n• Contributed to CFS MonoRepo utilising Full stack web development approach across \nFrontend, React and .NET Core APIs \n• Built Web pages using HTML and SAAS/CSS based on a Mock up provided by UX team. \n• Developed automated test framework in Cypress , JavaScript and jQuery and implemented \ntest scripts for testing UI in isolation while mocking APIs. \n• Developed automated test framework in C#, Selenium for end to end test scripts that runs in \na real test environment. \n• Developed PACT contract testing for APIs by writing Consumer and Provider contracts using \n.NET Core, Entity Framework InMemory DB, Mocking with Moq and C#. \nSoftware Engineer in Test (Web & APIs) \n2006- 2018 \nReserve Bank of Australia, Macquarie Bank, Qantas, Commonwealth Bank, Nasdaq & ACI Worldwide \nI worked with number of companies in Sydney during this time to deliver test automation \nframework in a Software Engineer in Test capacity. I worked on number of technologies such as SQL, \nNodeJS, JavaScript, Cypress, Mocha, Chai etc which has made me a versatile & hands-on software \nengineer. \n• Developed Behaviour driven development (BDD) based Selenium Web Automation \nframework from scratch and achieved 100% pass rate across entire automation suite.  \n• Worked with the whole project team to draft testing strategy for RBA’s digital initiative \nand got it approved by key stakeholders.  \n\n• Developed Pivot Tables to Talley total numbers of migrated accounts and their data \nattributes such as balances.  \n• Developed complex SQL queries to run against each data migration run to help detect \nissues.  \n• Developed test harness tool in C# to parse and verify AS2805 messages. Conducted \nFunctional and Certification Testing of VeriFone EFTPOS terminals and Distra Payment \ngateway (a.k.a. Switch)  \n• Setting up of end to end testing components such as Visa/MasterCard Simulator, \nchecking connections with the switch and other testing subsystems of participating \nbanks. \n \nSoftware  Engineer \nGemalto (Now, Thales), Baeurer Infotech Ltd. \n2001 – 2004 \n• Developed Terminal Parameter Management System using Microsoft technologies at the \ntime for Axalto Customers. This system enabled them to download parameters from remote \nsystem.  \n• Developed test tools and harnesses to test front-end clients.  \n• Developed SQL Server stored procedures and triggers to support front-end functionality  \n• Developed software modules for CRM applications and wrote back-end stored procedures, \nfunctions and triggers to support front-end functionality.  \n• Developed UI screens for desktop applications that work with the data provided by backend \ndatabase.  \n• Worked closely with software architects and DBAs to ensure, new code fits and play well in \nexisting codebase. \n \nEducation \n• B.Eng – Information Technology – Sardar Patel Univeristy, India 2001  \n• M.Eng – Telecommunication Engineering – RMIT University, Australia 2003"
    }
  ]
}